Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.LeftTagLineOffset Property
 The offset of the left tag line. The offset is measured in paper millimeters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double LeftTagLineOffset { get; set; }
Public Property LeftTagLineOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
StraightDimensionSet Class
Tekla.Structures.Drawing Namespace